---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.TextColor
source: html/85526178-c05b-7fa6-4ee6-a3b72e462f27.htm
---
# Autodesk.Revit.DB.TableCellStyle.TextColor Property

The text color of this cell.

## Syntax (C#)
```csharp
public Color TextColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null